  Процедура ДополнитьФорму(Форма) Экспорт
	  
	  ИмяФормы = Форма.ИмяФормы;
	   //Вельков Н. Проверка формы
	  Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда 
		  ДобавитьПолеКонтактноеЛицоВГруппу(Форма);
	  ИначеЕсли ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда 
		  ДобавитьПолеКонтактноеЛицоВГруппу(Форма);
	  ИначеЕсли ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда 
		  ДобавитьПолеКонтактноеЛицоВГруппу(Форма);
	  ИначеЕсли ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда 
		  ВставитьПолеКонтактноеЛицоНаФормуПередОснование(Форма);
	  ИначеЕсли ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда 
		  ВставитьПолеКонтактноеЛицоНаФормуПередОснование(Форма);
	  КонецЕсли;	  		  
	  //}}
  КонецПроцедуры
    
  Процедура ДобавитьПолеКонтактноеЛицоВГруппу(Форма)
	   // {{ Вельков Н. Добавление Справочник Контактное лицо на форму
	  ПолеВвода = Форма.Элементы.Добавить("КонтактноеЛицо",Тип("ПолеФормы"),Форма.Элементы.ГруппаШапкаПраво);
	  ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	  ПолеВвода.ПутьКДанным = "Объект.НВ_КонтактноеЛицо";
	   //}}
  КонецПроцедуры 
  
  Процедура ВставитьПолеКонтактноеЛицоНаФормуПередОснование(Форма)
	   // {{ Вельков Н. Добавление Справочник Контактное лицо на форму
	  ПолеВвода = Форма.Элементы.Вставить("КонтактноеЛицо",Тип("ПолеФормы"),,Форма.Элементы.Основание);
	  ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	  ПолеВвода.ПутьКДанным = "Объект.НВ_КонтактноеЛицо";
	  //}}
  КонецПроцедуры
